1. import pandas

In [1]:
import pandas as pd

2.1 create a data frame, name it df, and load the the data in mls_salaries.csv to it.

In [15]:
df = pd.read_csv('mls_salaries.csv')

2.2 explore your data using head(), tail(), describe() and info()

3.1  display only the first_name column

3.2 display only the first_name ,position and last name columns

4. add 1$ to base salary, make sure your changes are saved to the data frame

In [4]:
df['base_salary']= df['base_salary'].add(1)

5. add a new column, name it "best team" use "super strikers" as the default value in that column

6. add a column in the 2nd position, name it "age" use NaN as default (this may be a little harder that you expect)

In [19]:
import numpy as np

In [20]:
df.insert(1,column="age",value =np.nan)

In [21]:
df.head()

,club,age,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,NaN,Almiron,Miguel,M,1912500.0,2297000.00
1,ATL,NaN,Ambrose,Mikey,D,65625.0,65625.00
2,ATL,NaN,Asad,Yamil,M,150000.0,150000.00
3,ATL,NaN,Bloom,Mark,D,99225.0,106573.89
4,ATL,NaN,Carleton,Andrew,F,65000.0,77400.00

7. how many types of clubs are there?

In [8]:
df['club'].value_counts().count()

df['club'].nunique()

23

8. Which club is the most common?

In [11]:
df['club'].mode()

0    VAN
dtype: object

9. If you have some time left, you can create a function that receives a float between 0 and 1 and prints the corresponding quantile with a sentence.
For example, if it receives the number 0.7, it should print: 'The 70.0% quantile salary is 225000.0.'

In [23]:
df['base_salary'].quantile(0.7)

225000.0

In [24]:
def qf (num):
    per =num *100
    print(f"the {per}% quuantile salary is {df['base_salary'].quantile(num)}")

In [25]:
qf(0.7)

the 70.0% quuantile salary is 225000.0